MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM202/mcu.h
extern volatile CCP4CON2LBITS CCP4CON2Lbits __attribute__((__sfr__));

#define CCP4CON2H CCP4CON2H
extern volatile uint16_t CCP4CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP4CON2HBITS;
extern volatile CCP4CON2HBITS CCP4CON2Hbits __attribute__((__sfr__));

#define CCP4CON3H CCP4CON3H
extern volatile uint16_t CCP4CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :6;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :8;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP4CON3HBITS;
extern volatile CCP4CON3HBITS CCP4CON3Hbits __attribute__((__sfr__));

#define CCP4STAT CCP4STAT
extern volatile uint16_t CCP4STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP4STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP4STATBITS;
extern volatile CCP4STATBITS CCP4STATbits __attribute__((__sfr__));

#define CCP4STATL CCP4STATL
extern volatile uint16_t CCP4STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP4STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP4STATLBITS;
extern volatile CCP4STATLBITS CCP4STATLbits __attribute__((__sfr__));

#define CCP4TMRL CCP4TMRL
extern volatile uint16_t CCP4TMRL __attribute__((__sfr__));
#define CCP4TMRH CCP4TMRH
extern volatile uint16_t CCP4TMRH __attribute__((__sfr__));
#define CCP4PRL CCP4PRL
extern volatile uint16_t CCP4PRL __attribute__((__sfr__));
#define CCP4PRH CCP4PRH
extern volatile uint16_t CCP4PRH __attribute__((__sfr__));
#define CCP4RA CCP4RA
extern volatile uint16_t CCP4RA __attribute__((__sfr__));
#define CCP4RAL CCP4RAL
extern volatile uint16_t CCP4RAL __attribute__((__sfr__));
#define CCP4RB CCP4RB
extern volatile uint16_t CCP4RB __attribute__((__sfr__));
#define CCP4RBL CCP4RBL
extern volatile uint16_t CCP4RBL __attribute__((__sfr__));
#define CCP4BUFL CCP4BUFL
extern volatile uint16_t CCP4BUFL __attribute__((__sfr__));
#define CCP4BUFH CCP4BUFH
extern volatile uint16_t CCP4BUFH __attribute__((__sfr__));
#define CCP5CON1L CCP5CON1L
extern volatile uint16_t CCP5CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP5CON1LBITS;
extern volatile CCP5CON1LBITS CCP5CON1Lbits __attribute__((__sfr__));

#define CCP5CON1H CCP5CON1H
extern volatile uint16_t CCP5CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP5CON1HBITS;
extern volatile CCP5CON1HBITS CCP5CON1Hbits __attribute__((__sfr__));

#define CCP5CON2L CCP5CON2L
extern volatile uint16_t CCP5CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP5CON2LBITS;
extern volatile CCP5CON2LBITS CCP5CON2Lbits __attribute__((__sfr__));

#define CCP5CON2H CCP5CON2H
extern volatile uint16_t CCP5CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP5CON2HBITS;
extern volatile CCP5CON2HBITS CCP5CON2Hbits __attribute__((__sfr__));

#define CCP5CON3H CCP5CON3H
extern volatile uint16_t CCP5CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP5CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :6;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :8;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP5CON3HBITS;
extern volatile CCP5CON3HBITS CCP5CON3Hbits __attribute__((__sfr__));

#define CCP5STAT CCP5STAT
extern volatile uint16_t CCP5STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP5STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP5STATBITS;
