MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM202/mcu.h
#define _CCP2CON3H_PSSACE1_POSITION              0x00000003
#define _CCP2CON3H_PSSACE1_MASK                  0x00000008
#define _CCP2CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP2CON3H_OUTM0_POSITION                0x00000008
#define _CCP2CON3H_OUTM0_MASK                    0x00000100
#define _CCP2CON3H_OUTM0_LENGTH                  0x00000001

#define _CCP2CON3H_OUTM1_POSITION                0x00000009
#define _CCP2CON3H_OUTM1_MASK                    0x00000200
#define _CCP2CON3H_OUTM1_LENGTH                  0x00000001

#define _CCP2CON3H_OUTM2_POSITION                0x0000000A
#define _CCP2CON3H_OUTM2_MASK                    0x00000400
#define _CCP2CON3H_OUTM2_LENGTH                  0x00000001

#define _CCP2CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP2CON3H_OSCNT0_MASK                   0x00001000
#define _CCP2CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP2CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP2CON3H_OSCNT1_MASK                   0x00002000
#define _CCP2CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP2CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP2CON3H_OSCNT2_MASK                   0x00004000
#define _CCP2CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP2STAT_ICBNE_POSITION                 0x00000000
#define _CCP2STAT_ICBNE_MASK                     0x00000001
#define _CCP2STAT_ICBNE_LENGTH                   0x00000001

#define _CCP2STAT_ICOV_POSITION                  0x00000001
#define _CCP2STAT_ICOV_MASK                      0x00000002
#define _CCP2STAT_ICOV_LENGTH                    0x00000001

#define _CCP2STAT_ICDIS_POSITION                 0x00000002
#define _CCP2STAT_ICDIS_MASK                     0x00000004
#define _CCP2STAT_ICDIS_LENGTH                   0x00000001

#define _CCP2STAT_SCEVT_POSITION                 0x00000003
#define _CCP2STAT_SCEVT_MASK                     0x00000008
#define _CCP2STAT_SCEVT_LENGTH                   0x00000001

#define _CCP2STAT_ASEVT_POSITION                 0x00000004
#define _CCP2STAT_ASEVT_MASK                     0x00000010
#define _CCP2STAT_ASEVT_LENGTH                   0x00000001

#define _CCP2STAT_TRCLR_POSITION                 0x00000005
#define _CCP2STAT_TRCLR_MASK                     0x00000020
#define _CCP2STAT_TRCLR_LENGTH                   0x00000001

#define _CCP2STAT_TRSET_POSITION                 0x00000006
#define _CCP2STAT_TRSET_MASK                     0x00000040
#define _CCP2STAT_TRSET_LENGTH                   0x00000001

#define _CCP2STAT_CCPTRIG_POSITION               0x00000007
#define _CCP2STAT_CCPTRIG_MASK                   0x00000080
#define _CCP2STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP2STAT_ICGARM_POSITION                0x0000000A
#define _CCP2STAT_ICGARM_MASK                    0x00000400
#define _CCP2STAT_ICGARM_LENGTH                  0x00000001

#define _CCP2STAT_TRIG_POSITION                  0x00000007
#define _CCP2STAT_TRIG_MASK                      0x00000080
#define _CCP2STAT_TRIG_LENGTH                    0x00000001

#define _CCP2STATL_ICBNE_POSITION                0x00000000
#define _CCP2STATL_ICBNE_MASK                    0x00000001
#define _CCP2STATL_ICBNE_LENGTH                  0x00000001

#define _CCP2STATL_ICOV_POSITION                 0x00000001
#define _CCP2STATL_ICOV_MASK                     0x00000002
#define _CCP2STATL_ICOV_LENGTH                   0x00000001

#define _CCP2STATL_ICDIS_POSITION                0x00000002
#define _CCP2STATL_ICDIS_MASK                    0x00000004
#define _CCP2STATL_ICDIS_LENGTH                  0x00000001

#define _CCP2STATL_SCEVT_POSITION                0x00000003
#define _CCP2STATL_SCEVT_MASK                    0x00000008
#define _CCP2STATL_SCEVT_LENGTH                  0x00000001

#define _CCP2STATL_ASEVT_POSITION                0x00000004
#define _CCP2STATL_ASEVT_MASK                    0x00000010
#define _CCP2STATL_ASEVT_LENGTH                  0x00000001

#define _CCP2STATL_TRCLR_POSITION                0x00000005
#define _CCP2STATL_TRCLR_MASK                    0x00000020
#define _CCP2STATL_TRCLR_LENGTH                  0x00000001

#define _CCP2STATL_TRSET_POSITION                0x00000006
#define _CCP2STATL_TRSET_MASK                    0x00000040
#define _CCP2STATL_TRSET_LENGTH                  0x00000001

#define _CCP2STATL_CCPTRIG_POSITION              0x00000007
#define _CCP2STATL_CCPTRIG_MASK                  0x00000080
#define _CCP2STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP2STATL_ICGARM_POSITION               0x0000000A
#define _CCP2STATL_ICGARM_MASK                   0x00000400
#define _CCP2STATL_ICGARM_LENGTH                 0x00000001

#define _CCP2STATL_TRIG_POSITION                 0x00000007
#define _CCP2STATL_TRIG_MASK                     0x00000080
#define _CCP2STATL_TRIG_LENGTH                   0x00000001

#define _CCP3CON1L_MOD_POSITION                  0x00000000
#define _CCP3CON1L_MOD_MASK                      0x0000000F
#define _CCP3CON1L_MOD_LENGTH                    0x00000004

#define _CCP3CON1L_CCSEL_POSITION                0x00000004
#define _CCP3CON1L_CCSEL_MASK                    0x00000010
#define _CCP3CON1L_CCSEL_LENGTH                  0x00000001

#define _CCP3CON1L_T32_POSITION                  0x00000005
#define _CCP3CON1L_T32_MASK                      0x00000020
#define _CCP3CON1L_T32_LENGTH                    0x00000001

#define _CCP3CON1L_TMRPS_POSITION                0x00000006
#define _CCP3CON1L_TMRPS_MASK                    0x000000C0
#define _CCP3CON1L_TMRPS_LENGTH                  0x00000002

#define _CCP3CON1L_CLKSEL_POSITION               0x00000008
#define _CCP3CON1L_CLKSEL_MASK                   0x00000700
#define _CCP3CON1L_CLKSEL_LENGTH                 0x00000003

#define _CCP3CON1L_TMRSYNC_POSITION              0x0000000B
#define _CCP3CON1L_TMRSYNC_MASK                  0x00000800
#define _CCP3CON1L_TMRSYNC_LENGTH                0x00000001

#define _CCP3CON1L_CCPSLP_POSITION               0x0000000C
#define _CCP3CON1L_CCPSLP_MASK                   0x00001000
#define _CCP3CON1L_CCPSLP_LENGTH                 0x00000001

#define _CCP3CON1L_CCPSIDL_POSITION              0x0000000D
#define _CCP3CON1L_CCPSIDL_MASK                  0x00002000
#define _CCP3CON1L_CCPSIDL_LENGTH                0x00000001

#define _CCP3CON1L_CCPON_POSITION                0x0000000F
#define _CCP3CON1L_CCPON_MASK                    0x00008000
#define _CCP3CON1L_CCPON_LENGTH                  0x00000001

#define _CCP3CON1L_MOD0_POSITION                 0x00000000
#define _CCP3CON1L_MOD0_MASK                     0x00000001
#define _CCP3CON1L_MOD0_LENGTH                   0x00000001

#define _CCP3CON1L_MOD1_POSITION                 0x00000001
#define _CCP3CON1L_MOD1_MASK                     0x00000002
#define _CCP3CON1L_MOD1_LENGTH                   0x00000001

#define _CCP3CON1L_MOD2_POSITION                 0x00000002
#define _CCP3CON1L_MOD2_MASK                     0x00000004
#define _CCP3CON1L_MOD2_LENGTH                   0x00000001

