MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM202/mcu.h
#define _CTMUCON1H_EDG1SEL2_POSITION             0x0000000C
#define _CTMUCON1H_EDG1SEL2_MASK                 0x00001000
#define _CTMUCON1H_EDG1SEL2_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL3_POSITION             0x0000000D
#define _CTMUCON1H_EDG1SEL3_MASK                 0x00002000
#define _CTMUCON1H_EDG1SEL3_LENGTH               0x00000001

#define _CTMUCON2_DISCHS_POSITION                0x00000000
#define _CTMUCON2_DISCHS_MASK                    0x00000007
#define _CTMUCON2_DISCHS_LENGTH                  0x00000003

#define _CTMUCON2_IRSTEN_POSITION                0x00000004
#define _CTMUCON2_IRSTEN_MASK                    0x00000010
#define _CTMUCON2_IRSTEN_LENGTH                  0x00000001

#define _CTMUCON2_DISCHS0_POSITION               0x00000000
#define _CTMUCON2_DISCHS0_MASK                   0x00000001
#define _CTMUCON2_DISCHS0_LENGTH                 0x00000001

#define _CTMUCON2_DISCHS1_POSITION               0x00000001
#define _CTMUCON2_DISCHS1_MASK                   0x00000002
#define _CTMUCON2_DISCHS1_LENGTH                 0x00000001

#define _CTMUCON2_DISCHS2_POSITION               0x00000002
#define _CTMUCON2_DISCHS2_MASK                   0x00000004
#define _CTMUCON2_DISCHS2_LENGTH                 0x00000001

#define _CTMUCON2L_DISCHS_POSITION               0x00000000
#define _CTMUCON2L_DISCHS_MASK                   0x00000007
#define _CTMUCON2L_DISCHS_LENGTH                 0x00000003

#define _CTMUCON2L_IRSTEN_POSITION               0x00000004
#define _CTMUCON2L_IRSTEN_MASK                   0x00000010
#define _CTMUCON2L_IRSTEN_LENGTH                 0x00000001

#define _CTMUCON2L_DISCHS0_POSITION              0x00000000
#define _CTMUCON2L_DISCHS0_MASK                  0x00000001
#define _CTMUCON2L_DISCHS0_LENGTH                0x00000001

#define _CTMUCON2L_DISCHS1_POSITION              0x00000001
#define _CTMUCON2L_DISCHS1_MASK                  0x00000002
#define _CTMUCON2L_DISCHS1_LENGTH                0x00000001

#define _CTMUCON2L_DISCHS2_POSITION              0x00000002
#define _CTMUCON2L_DISCHS2_MASK                  0x00000004
#define _CTMUCON2L_DISCHS2_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN16_POSITION              0x00000000
#define _AD1CTMENH_CTMEN16_MASK                  0x00000001
#define _AD1CTMENH_CTMEN16_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN17_POSITION              0x00000001
#define _AD1CTMENH_CTMEN17_MASK                  0x00000002
#define _AD1CTMENH_CTMEN17_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN18_POSITION              0x00000002
#define _AD1CTMENH_CTMEN18_MASK                  0x00000004
#define _AD1CTMENH_CTMEN18_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN19_POSITION              0x00000003
#define _AD1CTMENH_CTMEN19_MASK                  0x00000008
#define _AD1CTMENH_CTMEN19_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN20_POSITION              0x00000004
#define _AD1CTMENH_CTMEN20_MASK                  0x00000010
#define _AD1CTMENH_CTMEN20_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN21_POSITION              0x00000005
#define _AD1CTMENH_CTMEN21_MASK                  0x00000020
#define _AD1CTMENH_CTMEN21_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN22_POSITION              0x00000006
#define _AD1CTMENH_CTMEN22_MASK                  0x00000040
#define _AD1CTMENH_CTMEN22_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN23_POSITION              0x00000007
#define _AD1CTMENH_CTMEN23_MASK                  0x00000080
#define _AD1CTMENH_CTMEN23_LENGTH                0x00000001

#define _AD1CTMENL_CTMEN0_POSITION               0x00000000
#define _AD1CTMENL_CTMEN0_MASK                   0x00000001
#define _AD1CTMENL_CTMEN0_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN1_POSITION               0x00000001
#define _AD1CTMENL_CTMEN1_MASK                   0x00000002
#define _AD1CTMENL_CTMEN1_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN2_POSITION               0x00000002
#define _AD1CTMENL_CTMEN2_MASK                   0x00000004
#define _AD1CTMENL_CTMEN2_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN3_POSITION               0x00000003
#define _AD1CTMENL_CTMEN3_MASK                   0x00000008
#define _AD1CTMENL_CTMEN3_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN4_POSITION               0x00000004
#define _AD1CTMENL_CTMEN4_MASK                   0x00000010
#define _AD1CTMENL_CTMEN4_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN5_POSITION               0x00000005
#define _AD1CTMENL_CTMEN5_MASK                   0x00000020
#define _AD1CTMENL_CTMEN5_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN9_POSITION               0x00000009
#define _AD1CTMENL_CTMEN9_MASK                   0x00000200
#define _AD1CTMENL_CTMEN9_LENGTH                 0x00000001

#define _AD1CTMENL_CTMEN10_POSITION              0x0000000A
#define _AD1CTMENL_CTMEN10_MASK                  0x00000400
#define _AD1CTMENL_CTMEN10_LENGTH                0x00000001

#define _AD1CTMENL_CTMEN11_POSITION              0x0000000B
#define _AD1CTMENL_CTMEN11_MASK                  0x00000800
#define _AD1CTMENL_CTMEN11_LENGTH                0x00000001

#define _AD1CTMENL_CTMEN12_POSITION              0x0000000C
#define _AD1CTMENL_CTMEN12_MASK                  0x00001000
#define _AD1CTMENL_CTMEN12_LENGTH                0x00000001

#define _AD1CTMENL_CTMEN13_POSITION              0x0000000D
#define _AD1CTMENL_CTMEN13_MASK                  0x00002000
#define _AD1CTMENL_CTMEN13_LENGTH                0x00000001

#define _AD1CTMENL_CTMEN14_POSITION              0x0000000E
#define _AD1CTMENL_CTMEN14_MASK                  0x00004000
#define _AD1CTMENL_CTMEN14_LENGTH                0x00000001

#define _AD1CTMENL_CTMEN15_POSITION              0x0000000F
#define _AD1CTMENL_CTMEN15_MASK                  0x00008000
#define _AD1CTMENL_CTMEN15_LENGTH                0x00000001

#define _ANSA_ANSA0_POSITION                     0x00000000
#define _ANSA_ANSA0_MASK                         0x00000001
#define _ANSA_ANSA0_LENGTH                       0x00000001

#define _ANSA_ANSA1_POSITION                     0x00000001
#define _ANSA_ANSA1_MASK                         0x00000002
#define _ANSA_ANSA1_LENGTH                       0x00000001

#define _ANSA_ANSA2_POSITION                     0x00000002
#define _ANSA_ANSA2_MASK                         0x00000004
#define _ANSA_ANSA2_LENGTH                       0x00000001

#define _ANSA_ANSA3_POSITION                     0x00000003
#define _ANSA_ANSA3_MASK                         0x00000008
#define _ANSA_ANSA3_LENGTH                       0x00000001

#define _ANSA_ANSA4_POSITION                     0x00000004
#define _ANSA_ANSA4_MASK                         0x00000010
#define _ANSA_ANSA4_LENGTH                       0x00000001

#define _ANSA_ANSELA0_POSITION                   0x00000000
#define _ANSA_ANSELA0_MASK                       0x00000001
#define _ANSA_ANSELA0_LENGTH                     0x00000001

#define _ANSA_ANSELA1_POSITION                   0x00000001
#define _ANSA_ANSELA1_MASK                       0x00000002
#define _ANSA_ANSELA1_LENGTH                     0x00000001

#define _ANSA_ANSELA2_POSITION                   0x00000002
#define _ANSA_ANSELA2_MASK                       0x00000004
#define _ANSA_ANSELA2_LENGTH                     0x00000001

